<a href="https://colab.research.google.com/github/aluqbnle/ml-sandbox/blob/master/11_treatment_of_categorical_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas

In [0]:
data = {'name': ['Ryo', 'Kaori', 'Hideyuki', 'Hayato', 'Miki', 'Saeko'],  # 名前
        'gender': ['M', 'F', 'M', 'M', 'F', 'F'],  # 性別
        'size': ['L', 'M', 'L', 'XL', 'M', 'S']  # 服のサイズ
        }

In [3]:
df = pandas.DataFrame(data, columns=['name', 'gender', 'size'])
df

       name gender size
0       Ryo      M    L
1     Kaori      F    M
2  Hideyuki      M    L
3    Hayato      M   XL
4      Miki      F    M
5     Saeko      F    S

In [4]:
df.dtypes

name      object
gender    object
size      object
dtype: object

In [0]:
# size2int は size to int の意味
size2int = {'S': 1, 'M': 2, 'L': 3, 'XL': 4}

In [6]:
df['size'] = df['size'].map(size2int)
df

       name gender  size
0       Ryo      M     3
1     Kaori      F     2
2  Hideyuki      M     3
3    Hayato      M     4
4      Miki      F     2
5     Saeko      F     1

In [0]:
# int2size は int to size の意味
int2size = {v: k for k, v in size2int.items()}

In [8]:
df['size'] = df['size'].map(int2size)
df

       name gender size
0       Ryo      M    L
1     Kaori      F    M
2  Hideyuki      M    L
3    Hayato      M   XL
4      Miki      F    M
5     Saeko      F    S

In [0]:
df['gender'] = pandas.Categorical(df['gender'], 
                                                      categories=['M', 'F'],
                                                      ordered=False)

In [10]:
df.dtypes

name        object
gender    category
size        object
dtype: object

In [11]:
pandas.get_dummies(df, columns=['gender'])

       name size  gender_M  gender_F
0       Ryo    L         1         0
1     Kaori    M         0         1
2  Hideyuki    L         1         0
3    Hayato   XL         1         0
4      Miki    M         0         1
5     Saeko    S         0         1

In [12]:
pandas.get_dummies(df, columns=['gender'], drop_first=True)

       name size  gender_F
0       Ryo    L         0
1     Kaori    M         1
2  Hideyuki    L         0
3    Hayato   XL         0
4      Miki    M         1
5     Saeko    S         1